app/Controllers/Admin/User.php

    public function index()
    {
        $userModel = new UserModel();
        $data =
            [
                'menu' => 'halUser',
                'nama' => "Administrator",
                'link' => "user",
                'list' => $userModel->findAll()
---
SELECT *
FROM `users`

    public function detail($id_users)
    {
        $userModel = new UserModel();
        $data =
            [
                'menu' => 'halUser',
                'item' => $this->userModel->find($id_users)
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '1'

            'avatar' => $namaavatar,
        ];

        $this->userModel->save($data);
---
INSERT INTO `users` (`nama`, `alamat`, `tempat_lahir`, `tanggal_lahir`, `jenis_kelamin`, `telepon`, `email`, `username`, `password`, `avatar`, `created_at`, `updated_at`) VALUES ('Lanjar Dwi Saputro', 'Banjarjo 18/04, Gedangan, Cepogo, Boyolali', 'Boyolali', '2002-11-29', 'Laki-laki', '085747768629', 'lanjar17@gmail.com', 'lanjar17', 'd43aea9952f5a1ca76b088067745af8d', 'no bg.png', '2023-11-13 13:45:00', '2023-11-13 13:45:00')

    public function getData()
    {
        if ($this->request->isAJAX()) {
            $userModel = new UserModel();
            $data = [
                'list' => $this->userModel->findAll()
            ];
---
SELECT *
FROM `users`

    public function edit($id_users)
    {
        if ($this->request->isAJAX()) {
            $item = $this->userModel->find($id_users);
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '1'

    public function delete($id_users)
    {
        if ($this->request->isAjax()) {
            $this->userModel->delete($id_users);
---
DELETE FROM `users`
WHERE `id_users` IN ('11')