app/Controllers/BaseController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);
        $cookie = get_cookie('username');
        if (isset($cookie)) {
            $userModel = new UserModel();
            $auth = $userModel->where(['username' => $cookie])->first();