app/Controllers/Otentikasi.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $otentik = $this->usermodel->where(['username' => $username])->first();