app/Models/UserModel.php

    function getDetail($username = false)
    {
        if ($username == false) {
            return $this->findAll();
        }
        return $this->where(['username' => $username])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'lanjar17'
 LIMIT 1